<?php

//function {{FUNCTION}}_filter_wpseo_breadcrumb_separator($this_options_breadcrumbs_sep): string
//{
//    return '<svg width="9" height="8" viewBox="0 0 9 8" fill="none" xmlns="http://www.w3.org/2000/svg"> <path d="M4.96064 7.99267L4.48923 7.52127L7.68065 4.32985L7.36525e-05 4.32985L7.39054e-05 3.66326L7.68065 3.66326L4.48923 0.471839L4.96064 0.000434211L8.95676 3.99655L4.96064 7.99267Z" fill="#030405" /> </svg>';
//}
//
//// add the filter
//add_filter('wpseo_breadcrumb_separator', '{{FUNCTION}}_filter_wpseo_breadcrumb_separator', 10, 1);
//
//add_filter('wpseo_breadcrumb_links', '{{FUNCTION}}_custom_breadcrumbs_style');
//
//function {{FUNCTION}}_custom_breadcrumbs_style($links)
//{
//    if (empty($links)) {
//        return $links;
//    }
//
//    foreach ($links as $index => $link) {
//        if ($index === 0) {
//            // КОД ДЛЯ ПЕРВОГО ЭЛЕМЕНТА (Иконка)
//            $icon = '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="www.w3.org" style="vertical-align: middle;">
//                        <path d="M4 16.025H7.692V11.0751C7.692 10.8521 7.76967 10.6653 7.925 10.5145C8.07967 10.363 8.27133 10.2873 8.5 10.2873H11.5C11.7287 10.2873 11.9207 10.363 12.076 10.5145C12.2307 10.6653 12.308 10.8521 12.308 11.0751V16.025H16V7.55054C16 7.45044 15.9777 7.35944 15.933 7.27754C15.8883 7.19564 15.8273 7.12415 15.75 7.06305L10.366 3.1066C10.2633 3.0195 10.1413 2.97595 10 2.97595C9.85867 2.97595 9.737 3.0195 9.635 3.1066L4.25 7.06305C4.17333 7.12545 4.11233 7.19695 4.067 7.27754C4.02167 7.35814 3.99933 7.44914 4 7.55054V16.025ZM3 16.025V7.55054C3 7.30094 3.05733 7.06467 3.172 6.84173C3.28667 6.61878 3.44467 6.43516 3.646 6.29087L9.031 2.31492C9.313 2.10497 9.635 2 9.997 2C10.359 2 10.683 2.10497 10.969 2.31492L16.354 6.28989C16.556 6.43419 16.714 6.61813 16.828 6.84173C16.9427 7.06467 17 7.30094 17 7.55054V16.025C17 16.2863 16.9003 16.5141 16.701 16.7085C16.5017 16.9028 16.268 17 16 17H12.116C11.8867 17 11.6947 16.9246 11.54 16.7738C11.3853 16.6224 11.308 16.4352 11.308 16.2122V11.2632H8.692V16.2122C8.692 16.4358 8.61467 16.623 8.46 16.7738C8.30533 16.9246 8.11367 17 7.885 17H4C3.732 17 3.49833 16.9028 3.299 16.7085C3.09967 16.5141 3 16.2863 3 16.025Z" fill="#66AEE8" />
//                     </svg>';
//            $links[$index]['text'] = $icon.'<span class="text">'.$links[$index]['text'].'</span>';
//        } else {
//            $links[$index]['text'] = '<span class="text">'.$links[$index]['text'].'</span>';
//        }
//    }
//
//    return $links;
//}
